{
  "council_file": "09-2665-S8",
  "title": "MOTION (PRICE - NAZARIAN) relative to funding for site assessment and oversight services of the Slauson Wall Site (Site) located at 5867 South Los Angeles Street.",
  "district": "CD 9",
  "appearances": [
    {
      "meeting_id": 17506,
      "date": "2025-12-02T18:00:00",
      "section": "Items for which Public Hearings Have Not Been Held - (10 Votes Required for Consideration)",
      "item_number": "(31)",
      "recommendation": "APPROVE funding in the amount of $198,483 from the Los Angeles Housing Department (LAHD) Low- and Moderate-Income Housing Fund No. 55J, Account 43N467, for use by LAHD for site assessment and oversight services related to the Site and authorize the LAHD to amend Contract C-130849 with the State of California Department of Toxic Substances Control, subject to the approval of the City Attorney as to form. AUTHORIZE the Controller to appropriate and transfer $100,000 funding from the LAHD to the Bureau of Sanitation (BOS) in the amounts and the accounts as noted in the Motion, attached to the Council file, for use by the BOS for environmental site assessment and remediation activities on the Slauson Wall Site located at 5867 South Los Angeles Street. AUTHORIZE the BOS to execute an agreement with Stantec Consulting Services Inc., to continue performing environmental assessment and remediation related activities. AUTHORIZE the General Manager of LAHD, or designee, to effectuate a non-financial transfer of jurisdiction and control of the City-owned Site located at 5930 South Wall Street, Los Angeles, CA 90003 (APN 6006-003-900) to the Economic and Workforce Development Department for a future mixed-use development, subject to the City Attorney approval as to form. Motion (Price - Nazarian) dated 11-07-25"
    }
  ],
  "attachments": [
    {
      "historyId": "03146ed6-ef63-4e2c-8fdb-d1fee0ae5836",
      "title": "Motion (Price - Nazarian) dated 11-07-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=03146ed6-ef63-4e2c-8fdb-d1fee0ae5836",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=03146ed6-ef63-4e2c-8fdb-d1fee0ae5836",
      "meeting_id": 17506,
      "has_summary": false
    }
  ],
  "first_seen": "2025-12-02T18:00:00",
  "last_seen": "2025-12-02T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}