{
  "council_file": "17-0193-S9",
  "title": "CONSIDERATION OF MOTION (YAROSLAVSKY - HUTT) relative to funding for the Esri geographic information system (GIS) software and cloud-based solutions that support primary operations in various City departments, bureaus, and Elected Offices.",
  "district": "",
  "appearances": [
    {
      "meeting_id": 17283,
      "date": "2025-11-12T10:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(50)",
      "recommendation": "REQUEST the Controller to realign appropriations within the Building and Safety Building Permit Enterprise Fund No. 48R/08 accounts totaling $92,804, to pay the Department of Building and Safety portion of Esri costs for GIS services in Fiscal Year (FY) 2025-26, to ensure continued benefits of the GIS software and maintenance support services during FY 2025-26: Decrease an appropriation of $92,804 within the Building and Safety Building Permit Enterprise Fund No. 48R/08 as follows: Account No. 08C204, Reserve for Future Costs; Amount: $92,804 Increase appropriations totaling $92,804 within the Building and Safety Permit Enterprise Fund No. 48R/03 as follows: Account No. 08C682, Engineering Special Services Fund; Amount: $92,804 REQUEST the Controller to transfer, as soon as possible, the amounts from the participating City departments and bureaus, and associated Fund and Appropriation Unit Numbers, identified in the table under Recommendation No. 2 of the Motion, attached to the Council file, totaling $4,420,833; to the Engineering Special Services Fund, Fund No. 682/50, Appropriation Unit No. TBD - Citywide Enterprise License Agreement - ESRI, Inc., so that the Bureau of Engineering can make full payment of the annual payment to Esri for its special GIS-related services. DIRECT all General Managers and Bureau Directors for the City departments and bureaus identified in Recommendation No. 2 of the Motion to complete the transfer of funds by no later than October 24, 2025, in coordination with the Controller. AUTHORIZE the Controller to make any technical corrections, if necessary, to effectuate the intent of the Motion. Community Impact Statement: None submitted (Budget and Finance Committee waived consideration of the above matter.) Motion (Yaroslavsky - Hernandez) dated 22-25"
    }
  ],
  "attachments": [
    {
      "historyId": "b9d5bb3c-4eb1-419b-a609-10801abd8a57",
      "title": "Motion (Yaroslavsky - Hernandez) dated 22-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=b9d5bb3c-4eb1-419b-a609-10801abd8a57",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=b9d5bb3c-4eb1-419b-a609-10801abd8a57",
      "meeting_id": 17283,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-12T10:00:00",
  "last_seen": "2025-11-12T10:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}