{
  "council_file": "21-1479-S4",
  "title": "CIVIL RIGHTS, EQUITY, IMMIGRATION, AGING AND DISABILITY and BUDGET AND FINANCE COMMITTEES’ REPORT relative to accepting grant funds from Communities Actively Living Independent and Free (CALIF) Fiscal Year (FY) 2025-26 for the Aging and Disability Resource Connection (ADRC) Program.",
  "district": "",
  "appearances": [
    {
      "meeting_id": 17506,
      "date": "2025-12-02T18:00:00",
      "section": "Items for which Public Hearings Have Been Held",
      "item_number": "(12)",
      "recommendation": "AUTHORIZE the General Manager, Department of Aging (DOA), or designee, to accept $81,673 from CALIF FY 2025-26 for the ADRC Program. AUTHORIZE the Controller to: Establish new accounts and appropriate funds for for the ADRC Grant Program within the Fund No. 597 fund for Senior Services as follows: Account No. 02C102, Aging; Amount: $70,099 Transfer the FY 24-25 ADRC grant of $11,574 to FY 25-26 and establish a new account and appropriate funds within the Fund No. 597 fund for Senior Services for the period ending June 30, 2026 as follows: From: Account No. 597/02A102, Aging; Amount: $11,574 To: Account No. 597/02C102, Aging; Amount: $11,574 Increase appropriations within Fund No. 100/02 and transfer funds on an as needed basis as follows: From: Fund No. 597, Account No. 02C102, Aging; Amount: $81,673 To: Fund No. 100/02, Account No. 001010, Salaries-General; Amount: $5,179 Fund No. 100/02, Account No. 001070, Salaries – As Needed; Amount: $64,920 Fund No. 100/02, Account No. 006010, Office & Adm Exp.; Amount: $11,574 Expend funds upon proper demand of the General Manager, DOA, or designee. AUTHORIZE the General Manager, DOA, or designee, to prepare Controller instructions for any technical adjustments, that are consistent with the Mayor and Council actions on this matter, subject to the approval of the City Administrative Officer (CAO), and request the City Controller to implement the instructions. Fiscal Impact Statement: The DOA reports that the proposed recommendations involve the allocation of the ADRC pass through grant funds originating from the California Department of Aging. There is no additional impact to the City General Fund. Community Impact Statement: None submitted Joint Report from Civil Rights, Equity, Immigration, Aging, and Disability and Budget and Finance Committees_11-4-25 Report from Department of Aging dated 10-02-25"
    }
  ],
  "attachments": [
    {
      "historyId": "95995b68-38e9-455b-8ffe-f4733d4dedc3",
      "title": "Joint Report from Civil Rights, Equity, Immigration, Aging, and Disability and Budget and Finance Committees_11-4-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=95995b68-38e9-455b-8ffe-f4733d4dedc3",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=95995b68-38e9-455b-8ffe-f4733d4dedc3",
      "meeting_id": 17506,
      "has_summary": false
    },
    {
      "historyId": "e148287c-16ac-44cb-8bde-da0af7877227",
      "title": "Report from Department of Aging dated 10-02-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=e148287c-16ac-44cb-8bde-da0af7877227",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=e148287c-16ac-44cb-8bde-da0af7877227",
      "meeting_id": 17506,
      "has_summary": false
    }
  ],
  "first_seen": "2025-12-02T18:00:00",
  "last_seen": "2025-12-02T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 2,
    "attachments_with_summaries": 0
  }
}