{
  "council_file": "25-0874-S1",
  "title": "GOVERNMENT OPERATIONS and BUDGET AND FINANCE COMMITTEES’ REPORT relative to the Fiscal Year (FY) 2025-26 Second Construction Projects Report.",
  "district": "",
  "appearances": [
    {
      "meeting_id": 17506,
      "date": "2025-12-02T18:00:00",
      "section": "Items for which Public Hearings Have Been Held",
      "item_number": "(13)",
      "recommendation": "AUTHORIZE the Controller to: Transfer $27,119,080 between departments and funds as specified in Attachment 1 of the October 15, 2025 City Administrative Officer (CAO) report, attached to the Council file. Transfer $700,000 between accounts within departments and funds as specified in Attachment 2 of the October 15, 2025 CAO report, attached to the Council file. Appropriate $4,160,494 between accounts within departments and funds as specified in Attachment 3 of the October 15, 2025 CAO report, attached to the Council file. In accordance with Recommendation No. 1a, reimburse the General Fund within the Municipal Improvement Corporation of Los Angeles (MICLA), upon CAO approval and receipt of requesting departments’ labor services, construction materials, and supply invoices for completed work to include reimbursements for labor services that must contain an hourly breakdown with task descriptions and codes detailing the completed MICLA eligible work, in connection with departmental accounts designated for the following projects, as detailed in the October 15, 2025 CAO report, attached to the Council file: Access Control Units Replacement, City Hall East (Item N) City Hall East Structural Assessment Project, Planter Asbestos Abatement (Item R) Seventh Street Body Shop (Item T) Alterations and Improvement (Item X) Frank Hotchkin Memorial Training Center Improvements (Item Z) AUTHORIZE the following: Establishing a new appropriation account entitled Seventh Street Body Shop in the amount of $2.0 million within MICLA Fund No. 298/40, Account No. TBD - Seventh Street Body Shop Reprogramming 2023-24 and 2025-26 MICLA Funding and Communications Equipment Purchases as detailed in Items V and W of the October 15, 2025 CAO report, attached tot he Council file. Reprogramming MICLA savings from equipment purchases adopted in the 2023-24 and 2025-26 budgets to purchase replacement vehicles. AUTHORIZE the CAO to make technical corrections, as necessary, to the transactions authorized through said CAO report, as required to implement the intent of those transactions. Fiscal Impact Statement: The CAO reports that the recommendations stated in the October 15, 2025 CAO report, attached to the Council file, include transfers, appropriations, and authority for expenditures totaling $32.0 million. This consists of $4.9 million from various special funds, $23.4 million in MICLA funds, $2.2 million in Capital and Technology Improvement Expenditure Program (CTIEP) funds, and $1.4 million in General Fund. All transfers and appropriations are based on existing funds, reimbursements, or revenues. There is an anticipated General Fund impact in an amount not yet determined for operations and maintenance costs of the Barnsdall Art Park – Residence, a facility that is currently not in operation. These costs will be addressed through the City budget process at the time the facility is scheduled for completion Financial Policies Statement: The CAO reports that the recommendations stated in the October 15, 2025 CAO report, attached to the Council file, comply with the City’s Financial Policies in that appropriations for funds are limited to available cash balances needed to fund ongoing maintenance, programming, project shortfalls, and critical operational needs in the current budget year. Debt Impact Statement: The CAO reports that the issuance of MICLA debt is a General Fund obligation. The proposed MICLA fund appropriation for the capital project described in Item T would cause the City to borrow $2.0 million at an approximate 5.5 percent interest rate over a period of 20 years. The total estimated debt service for the MICLA-funded projects is $3.3 million, including interest of approximately $1.3 million. The estimated average annual debt service is $167,000 over a period of 20 years. Actual interest rates may differ as rates are dependent on market conditions at the time of issuance. The CAO cannot fully predict what interest rates will be in the future. In accordance with the City's Debt Management Policy, the City has an established debt ceiling to guide the evaluation of the affordability for future debt. The debt ceiling for non-voted direct debt as a percentage of General Fund revenues is six percent. The 2025-26 Adopted Budget non-voter-approved debt service ratio is 2.40 percent. The issuance of MICLA debt for these projects will not cause the City to exceed the six percent non-voter-approved debt limit. Community Impact Statement: None submitted. Joint Government Operations and Budget and Finance Committee Report 11-6-25 Transmittal Letter 10-21-25 Report from City Administrative Officer dated 10-15-25"
    }
  ],
  "attachments": [
    {
      "historyId": "bd07c52f-3b9a-43e3-9b50-b407235c8c8d",
      "title": "Joint Government Operations and Budget and Finance Committee Report 11-6-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=bd07c52f-3b9a-43e3-9b50-b407235c8c8d",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=bd07c52f-3b9a-43e3-9b50-b407235c8c8d",
      "meeting_id": 17506,
      "has_summary": false
    },
    {
      "historyId": "fc0e0a49-ea45-47e8-a449-5d73078b262a",
      "title": "Transmittal Letter 10-21-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=fc0e0a49-ea45-47e8-a449-5d73078b262a",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=fc0e0a49-ea45-47e8-a449-5d73078b262a",
      "meeting_id": 17506,
      "has_summary": false
    },
    {
      "historyId": "9698e20f-ec41-47b1-8101-4a3a67be7a49",
      "title": "Report from City Administrative Officer dated 10-15-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=9698e20f-ec41-47b1-8101-4a3a67be7a49",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=9698e20f-ec41-47b1-8101-4a3a67be7a49",
      "meeting_id": 17506,
      "has_summary": false
    }
  ],
  "first_seen": "2025-12-02T18:00:00",
  "last_seen": "2025-12-02T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 3,
    "attachments_with_summaries": 0
  }
}