{
  "council_file": "25-1293",
  "title": "MOTION (SOTO-MARTINEZ - HERNANDEZ) relative to funding for emergency assistance services in Council District 13 in partnership with the FamilySource Centers based at P.F. Bresee Foundation and El Centro del Pueblo.",
  "district": "CD 13",
  "appearances": [
    {
      "meeting_id": 17283,
      "date": "2025-11-12T10:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(26)",
      "recommendation": "AUTHORIZE the General Manager, or designee, of the Community Investment for Families Department (CIFD) to: a. Execute a contract amendment to City Contract No. C-202523 with P.F. Bresee Foundation to add $307,000 to increase emergency assistance resources available to residents in Council District 13, subject to the approval of the City Attorney as to form. b. Execute a contract amendment to City Contract No. C-202521 with El Centro de) Pueblo to add $100,000 to increase emergency assistance resources available to residents in Council District 13, subject to the approval of the City Attorney as to form. c. Utilize $207,000 of the funds appropriated to Fund 10E Public Assistance Benefit Program Fund, Department No. 21, Appropriation Account No. 21C246, CD 13 Emergency Financial Assistance program in Council file No. 24-1244-S 1 to increase emergency assistance resources available to residents in Council District 13. d. Disburse $207,000 from Fund 10E Public Assistance Benefit Program Fund, Department No. 21, Appropriation Account No. 21C246, CD 13 Emergency Financial Assistance program to P.F. Bresee Foundation, City Contract No. C-202523, for the above purpose. AUTHORIZE the City Controller to transfer $200,000 from the AB 1290 Fund No. 53P, Account No. 281213 (CD 13 Redevelopment Projects - Services) to the Community Investment for Families Fund No. 100/21, Account No. 003040 Contractual Services Account to increase emergency assistance resources available to residents in Council District 13. Motion (Soto-Martinez - Hernandez) dated 10-31-25"
    }
  ],
  "attachments": [
    {
      "historyId": "c8c25807-d32d-40aa-99a2-efebb4264947",
      "title": "Motion (Soto-Martinez - Hernandez) dated 10-31-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=c8c25807-d32d-40aa-99a2-efebb4264947",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=c8c25807-d32d-40aa-99a2-efebb4264947",
      "meeting_id": 17283,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-12T10:00:00",
  "last_seen": "2025-11-12T10:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}