{
  "council_file": "25-1300",
  "title": "MOTION (JURADO - HERNANDEZ) relative to funding and contracts with the FamilySource Centers operated by El Centro de Ayuda and Barrio Action Youth & Family Center to increase emergency assistance resources available to residents in Council District 14.",
  "district": "CD 14",
  "appearances": [
    {
      "meeting_id": 17283,
      "date": "2025-11-12T10:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(29)",
      "recommendation": "TRANSFER and APPROPRIATE $300,000 from the AB1290 Fund No. 53P, Account No. 281214 (CD 14 Redevelopment Projects - Services) to the Community Investment for Families Fund No. 100/21, Account No. 003040 (Contractual Services) to increase emergency assistance resources available to residents in Council District 14. AUTHORIZE the General Manager, or designee, Community Investment for Families Department (CIFD) to execute contract amendments to City Contract No. C-202520 with El Centro de Ayuda to add $150,000 and to City Contract No. C-202504 with Barrio Action Youth & Family Center to add $150,000 to increase emergency assistance resources available to residents in Council District 14, subject to the approval of the City Attorney as to form. AUTHORIZE the CIFD to make any corrections, clarifications or revisions to the above fund transfer instructions, including any new instructions, in order to effectuate the intent of this Motion, and including any corrections and changes to fund or account numbers; said corrections / clarifications / changes may be made orally, electronically or by any other means. Motion (Jurado - Hernandez) dated 11-04-25"
    }
  ],
  "attachments": [
    {
      "historyId": "372926c8-c109-44c7-9958-49d13155d436",
      "title": "Motion (Jurado - Hernandez) dated 11-04-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=372926c8-c109-44c7-9958-49d13155d436",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=372926c8-c109-44c7-9958-49d13155d436",
      "meeting_id": 17283,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-12T10:00:00",
  "last_seen": "2025-11-12T10:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}