{
  "council_file": "25-1286",
  "title": "MOTION (McOSKER - HUTT) relative to a Subrecipient Agreement with Foothill Transit in order to “pass through” the Federal Transit Administration (FTA) grant funds and implement the Grand Lot Project in Council District 15.",
  "district": "CD 15",
  "appearances": [
    {
      "meeting_id": 17406,
      "date": "2025-11-05T18:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(36)",
      "recommendation": "AUTHORIZE the Department of Transportation (DOT) to: Negotiate and execute a Subrecipient Agreement with Foothill Transit for the FTA Award (CA-2024-148) in the amount of $1,027,005 that was awarded to the City as the Designated Recipient for the development of a bus layover facility located at West 17th Street and South Grand Avenue (Grand Lot Project). Accept and deposit $1,027,005 in FTA grant funds from the FTA Award (CA-2024-148) into Proposition A Local Transit Fund No. 395/94 and appropriate therein to a new account, entitled “FTA Grant Foothill Transit Front Funds - Grand Lot Project”; and, authorize the DOT to utilize this account to front-fund grant-funded work by Foothill Transit, as the Subrecipient, for an amount up to $1,027,005. Execute a budget revision in the existing grant award with FTA (CA-2024-148) to reallocate the $2,289,993 from the East 16th Street and Maple Avenue lot improvement project to the Harbor City Zero Emission Bus Yard Development Project. Make any corrections, clarifications or revisions to the above instructions, including any new instructions, in order to effectuate the intent of this Motion, and including any corrections and changes to fund or account numbers; said corrections/clarifications changes may be made orally, electronically or by any other means."
    }
  ],
  "attachments": [],
  "first_seen": "2025-11-05T18:00:00",
  "last_seen": "2025-11-05T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 0,
    "attachments_with_summaries": 0
  }
}