{
  "council_file": "25-1296",
  "title": "City Administrative Officer report relative to agreements between the Los Angeles Housing Department and multiple contractors to provide the required services to operate the Handy Worker Program.",
  "district": "",
  "appearances": [
    {
      "meeting_id": 17498,
      "date": "2025-11-12T22:00:00",
      "section": "Housing and homelessness reports",
      "item_number": "(3)",
      "recommendation": ""
    },
    {
      "meeting_id": 17559,
      "date": "2025-12-03T18:00:00",
      "section": "Items for which Public Hearings Have Been Held",
      "item_number": "(38)",
      "recommendation": "NOTE and FILE the LAHD report dated October 9, 2025, contained in the City Administrative Officer (CAO) report dated October 29, 2025, attached to Council file No. 25-1296, relative to executing various City contracts for the Handyworker Program. AUTHORIZE the General Manager, LAHD, or designee, to: Execute a new agreement with AG Pacific Construction & Development Corp. for Class B General Construction services, in an amount not to exceed $544,554 for a term of nine (9) months commencing on January 1, 2026 through September 30, 2026, with the option to renew for up to two (2) one-year terms, in substantial conformance with the Agreement contained in the CAO report dated October 29, 2025, attached to the Council file, subject to the review and approval of the City Attorney as to form, funding availability, and compliance with the City’s contracting requirements. Execute a new agreement with the Coalition for Responsible Community Development for Class B General Construction services, in an amount not to exceed $218,773 for a term of nine (9) months commencing on January 1, 2026 through September 30, 2026, with the option to renew for up to two (2) one-year terms, in substantial conformance with the Agreement contained in the CAO report dated October 29, 2025, attached to the Council file, subject to the review and approval of the City Attorney as to form, funding availability, and compliance with the City’s contracting requirements. Execute a new agreement with Watts Labor Community Action Committee for Class B General Construction services, in an amount not to exceed $124,549 for a term of nine (9) months commencing on January 1, 2026 through September 30, 2026, with the option to renew for up to two (2) one-year terms, in substantial conformance with the Agreement contained in the CAO report dated October 29, 2025, attached to the Council file, subject to the review and approval of the City Attorney as to form, funding availability, and compliance with the City’s contracting requirements. Execute a sole source contract with EMSL Analytical, Inc. dba LA Testing for lead testing services in an amount not to exceed $15,000, for a term of nine (9) months commencing on January 1, 2026 through September 30, 2026, with the option to renew for up to two (2) one-year terms, in substantial conformance with the Agreement contained in the CAO report dated October 29, 2025, attached to the Council file, subject to the review and approval of the City Attorney as to form, funding availability, and compliance with the City’s contracting requirements. Prepare Controller instructions and any technical adjustments consistent with the Mayor and Council actions related to this matter, subject to the approval of the CAO; and Request the Controller to implement those instructions. REQUEST the Controller to: Transfer $78,815 from Fund No. 43H624 Dupont Lead Safe to a new Account No. 43C588 - Handyworker within the LAHD Small Grants & Awards Fund No. 49N. Transfer the following to Account No. 21C588 - Handyworker within the Community Development Block Grant Fund No. 424. Account No. 21C143, Account Name – LAHD, Amount - $583,281 Account No. 21C299, Account Name – Reimbursement of GF Costs, Amount - $228,996 ​​​​​​​ Decrease $583,281 within Fund No. 100/43 Account No. 001010 Salaries General. Fiscal Impact Statement: The CAO reports that the proposed Handyworker contracts will be funded by the Community Development Block Grant through the 51st Program Year 2025-26 Consolidated Plan. Funding for each of the two subsequent fiscal years is subject to Mayor and Council approval of the Consolidated Plan. The City’s financial obligation will be limited to funds appropriated for this purpose. There is no additional impact to the General Fund. Financial Policies Statement: The CAO reports that the above recommendations comply with the City’s Financial Policies in that grant funds will be used for grant-eligible activities. Community Impact Statement: None submitted Report from Housing and Homelessness Committee - 11-12-25 Report from City Administrative Officer dated 10-29-25"
    }
  ],
  "attachments": [
    {
      "historyId": "de2b8f9f-fdc3-436c-852d-9f750efcb9ed",
      "title": "Report from City Administrative Officer dated 10-29-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=de2b8f9f-fdc3-436c-852d-9f750efcb9ed",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=de2b8f9f-fdc3-436c-852d-9f750efcb9ed",
      "meeting_id": 17498,
      "has_summary": false
    },
    {
      "historyId": "59c2b5d4-8d71-41dd-8e86-003580189dcb",
      "title": "Report from Housing and Homelessness Committee - 11-12-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=59c2b5d4-8d71-41dd-8e86-003580189dcb",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=59c2b5d4-8d71-41dd-8e86-003580189dcb",
      "meeting_id": 17559,
      "has_summary": false
    },
    {
      "historyId": "d0bbeb04-3985-48ab-bc86-90d8268ae446",
      "title": "Report from City Administrative Officer dated 10-29-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=d0bbeb04-3985-48ab-bc86-90d8268ae446",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=d0bbeb04-3985-48ab-bc86-90d8268ae446",
      "meeting_id": 17559,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-12T22:00:00",
  "last_seen": "2025-12-03T18:00:00",
  "stats": {
    "total_appearances": 2,
    "total_attachments": 3,
    "attachments_with_summaries": 0
  }
}