{
  "council_file": "25-1288",
  "title": "MOTION (JURADO - PADILLA) relative to the acceptance of grant funds from the Los Angeles County Metropolitan Transportation Authority (Metro) for the 6th Street Viaduct Park, Arts, and River Connectivity (PARC) Street and Transit Improvements Project.",
  "district": "CD 14",
  "appearances": [
    {
      "meeting_id": 17406,
      "date": "2025-11-05T18:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(38)",
      "recommendation": "AUTHORIZE the Bureau of Engineering (BOE), to accept and deposit $2,000,000 in grant funds from the Metro into the Engineering Special Services Fund No. 682/50, and appropriate a like amount therein to a new account entitled “Sixth Street Viaduct - Park, Arts, and River Connectivity (PARC) Improvement Project - Street and Transit Improvements” for the construction of the 6th Street PARC Street and Transit Improvements. AUTHORIZE the BOE, with the assistance from the City Administrative Officer and Department of Public Works, Office of Accounting, to utilize Municipal Improvement Corporation of Los Angeles (MICLA) Fund No. 298/50, Account No. 50CPKM [Sixth Street Park, Arts, and River Connectivity (PARC) Improvement Project], approved in the 2025-26 Adopted Budget, to front-fund grant-funded work for an amount up to $2,000,000. AUTHORIZE the BOE to make any corrections, clarifications or revisions to the above fund transfer instructions, including any new instructions, in order to effectuate the intent of this Motion, and including any corrections and changes to fund or account numbers; said corrections / clarifications / changes may be made orally, electronically, or by any other means. Motion (Jurado - Padilla) dated 10-29-25"
    }
  ],
  "attachments": [
    {
      "historyId": "39aba558-6e4c-454f-927d-ada39179b928",
      "title": "Motion (Jurado - Padilla) dated 10-29-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=39aba558-6e4c-454f-927d-ada39179b928",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=39aba558-6e4c-454f-927d-ada39179b928",
      "meeting_id": 17406,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-05T18:00:00",
  "last_seen": "2025-11-05T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}