{
  "council_file": "25-1270",
  "title": "CONSIDERATION OF MOTION (NAZARIAN – JURADO) relative to designating Council District Two (CD 2) as the lead agency for the Phase I and Phase II Chandler Bikeway improvements constructed within a portion of the Los Angeles County Metropolitan Transportation Authority (LACMTA) right-of-way.",
  "district": "CD 2",
  "appearances": [
    {
      "meeting_id": 17407,
      "date": "2025-11-04T18:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(40)",
      "recommendation": "DESIGNATE CD 2 as the City's lead agency for coordination and ongoing maintenance oversight of the Phase I and Phase II Chandler Bikeway improvements located on LACMTA-owned property adjacent to the paved bikeway, including but not limited to solar pedestrian lighting, decorative fencing and handrails, retaining-wall mural, exercise stations, bike racks, gabion benches, and concrete walk and pavement improvements. DIRECT the Bureau of Engineering, Bureau of Street Services, Bureau of Street Lighting, and Los Angeles Department of Transportation (LADOT), in coordination with the LACMTA, to finalize and execute documents substantially identical to the attached amendment to the existing Chandler Bikeway license agreement and incorporating the Phase I and II improvements into the City's maintenance framework under the leadership of CD 2, with LADOT remaining the lead agency for the paved bikeway surface and adjacent 10-foot landscaped strip pursuant to prior Council action (Council file Nos. 99-1324 and 04-2387). Community Impact Statement: None submitted. (Transportation Committee waived consideration of the above matter) Motion (Nazarian - Jurado) dated 10-24-25"
    }
  ],
  "attachments": [
    {
      "historyId": "e1fdbff9-53b9-4666-a652-2cc2c1897ab3",
      "title": "Motion (Nazarian - Jurado) dated 10-24-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=e1fdbff9-53b9-4666-a652-2cc2c1897ab3",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=e1fdbff9-53b9-4666-a652-2cc2c1897ab3",
      "meeting_id": 17407,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-04T18:00:00",
  "last_seen": "2025-11-04T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}