{
  "council_file": "25-1190",
  "title": "HOUSING AND HOMELESSNESS COMMITTEE REPORT relative to executing an Agreement between the Los Angeles Housing Department (LAHD) and the Inner City Law Center to provide legal representation services for the United to House LA (ULA) Protections from Tenant Harassment Program.",
  "district": "",
  "appearances": [
    {
      "meeting_id": 17559,
      "date": "2025-12-03T18:00:00",
      "section": "Items for which Public Hearings Have Been Held",
      "item_number": "(21)",
      "recommendation": "AUTHORIZE the General Manager, LAHD, or designee to: Execute a contract with Inner City Law Center to perform legal representation services for an amount not to exceed $5,792,482 for a three year term commencing on or about November 1, 2025 through October 31, 2028, in substantial conformance with the draft Agreement contained in the City Administrative Officer report (CAO) dated September 30, 2025, attached to Council file No. 25-1190, subject to the review and approval of the City Attorney as to form and contractor compliance with the City’s contracting requirements. Prepare Controller instructions and any technical adjustments consistent with the Mayor and Council actions related to this matter. Fiscal Impact Statement: The CAO reports that funding for the proposed contract is supported through revenue collected and deposited into the ULA Fund No. 66M, which was appropriated through the 2023-24 and 2025-26 ULA expenditure plans. The City’s financial obligation will be limited to funds appropriated for this purpose. There is no impact to the General Fund. Financial Policies Statement: The CAO reports that the recommendations in this report comply with the City’s Financial Policies in that the proposed contract will be funded by dedicated funding source and expenditures will be limited to the mandates of the funding source. Community Impact Statement: None submitted Report from Housing and Homelessness Committee - 11-5-25 Report from City Administrative Officer dated 9-30-25"
    }
  ],
  "attachments": [
    {
      "historyId": "9d4199d7-7153-4b83-bd09-af773a8c532f",
      "title": "Report from Housing and Homelessness Committee - 11-5-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=9d4199d7-7153-4b83-bd09-af773a8c532f",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=9d4199d7-7153-4b83-bd09-af773a8c532f",
      "meeting_id": 17559,
      "has_summary": false
    },
    {
      "historyId": "b34fb5aa-4855-43fc-ae9e-802fd60dbb7f",
      "title": "Report from City Administrative Officer dated 9-30-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=b34fb5aa-4855-43fc-ae9e-802fd60dbb7f",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=b34fb5aa-4855-43fc-ae9e-802fd60dbb7f",
      "meeting_id": 17559,
      "has_summary": false
    }
  ],
  "first_seen": "2025-12-03T18:00:00",
  "last_seen": "2025-12-03T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 2,
    "attachments_with_summaries": 0
  }
}