{
  "council_file": "25-1351",
  "title": "MOTION (HERNANDEZ - RODRIGUEZ) relative to emergency rental assistance services for residents in Council District 1.",
  "district": "CD 1",
  "appearances": [
    {
      "meeting_id": 17506,
      "date": "2025-12-02T18:00:00",
      "section": "Items for which Public Hearings Have Not Been Held - (10 Votes Required for Consideration)",
      "item_number": "(40)",
      "recommendation": "AUTHORIZE the General Manager, or designee, of the Community Investment for Families Department to amend and restate City Contract No. C-202536 with Central City Neighborhood Partners - Westlake to increase the contract by $300,000 for the provision of emergency assistance to residents in Council District One through June 30, 2026. AUTHORIZE the Controller to transfer $200,000 from the General City Purposes Fund No. 100/56, Account No. 000615 (Additional Homeless Services - CD 1) to the Community Investment for Families Fund No. 100/21, Account No. 003040 Contractual Services Account. AUTHORIZE the Controller to transfer $100,000 from the Transfer of Floor Area Rights Public Benefit Payment Trust Fund No. 552/14, Account No. TBD “Emergency Rental Assistance Program” to the Community Investment for Families Fund No. 100/21, Account No. 003040 Contractual Services Account. AUTHORIZE the Chief Legislative Analyst to make any technical corrections, clarifications, or revisions as necessary, to implement the Motion’s intent. Motion (Hernandez - Rodriguez) dated 11-14-25"
    }
  ],
  "attachments": [
    {
      "historyId": "dda91964-63ee-44ac-8156-e8f209383427",
      "title": "Motion (Hernandez - Rodriguez) dated 11-14-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=dda91964-63ee-44ac-8156-e8f209383427",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=dda91964-63ee-44ac-8156-e8f209383427",
      "meeting_id": 17506,
      "has_summary": false
    }
  ],
  "first_seen": "2025-12-02T18:00:00",
  "last_seen": "2025-12-02T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}