{
  "council_file": "25-1194-S1",
  "title": "MOTION (PADILLA - RODRIGUEZ) relative to funding for the design and delivery of an At Home Hydroponic Gardening project in the Mission Hills - Panorama City - North Hills REPAIR Zone.",
  "district": "CD 6",
  "appearances": [
    {
      "meeting_id": 17283,
      "date": "2025-11-12T10:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(25)",
      "recommendation": "AUTHORIZE $338,000 of the total available grant from Fund No. 641 L.A. REPAIR Innovation Fund, Account No. 15V200, Project Costs for the Mission Hills - Panorama City - North Hills REPAIR Zone to be utilized by Mid Valley YMCA, and authorize the execution of the grant agreement contract administered by the Civil + Human Rights and Equity Department, for the design and delivery of an At Home Hydroponic Gardening project in the Mission Hills - Panorama City - North Hills REPAIR Zone. AUTHORIZE that the Civil + Human Rights and Equity Department to make any corrections, clarifications or revisions to the above instructions, including any new instructions, in order to effectuate the intent of this Motion, and including any corrections and changes to fund or account numbers; said corrections/ clarifications / changes may be made orally, electronically or by any other means. Motion (Padilla - Rodriguez) dated 10-31-25"
    }
  ],
  "attachments": [
    {
      "historyId": "ce7f24d3-32d4-477e-8bb9-4559bcdbccbf",
      "title": "Motion (Padilla - Rodriguez) dated 10-31-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=ce7f24d3-32d4-477e-8bb9-4559bcdbccbf",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=ce7f24d3-32d4-477e-8bb9-4559bcdbccbf",
      "meeting_id": 17283,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-12T10:00:00",
  "last_seen": "2025-11-12T10:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}