{
  "council_file": "25-1281",
  "title": "MOTION (HERNANDEZ - HUTT) relative to funding for food distribution services coordinated by Central City Neighborhood Partners (CCNP) in Council District One (CD 1).",
  "district": "CD 1",
  "appearances": [
    {
      "meeting_id": 17407,
      "date": "2025-11-04T18:00:00",
      "section": "No hearings held (requires 10 votes)",
      "item_number": "(38)",
      "recommendation": "TRANSFER and APPROPRIATE $200,000 from the AB1290 Fund No. 53P, Account No. 281201 (CD 1 Redevelopment Projects - Services) to the Community Investment for Families Department (CIFD) Fund No. 100/21, Account No. 3040 (Contractual Services), for food distribution services in CD 1, to be coordinated by the CCNP. AUTHORIZE the General Manager, CIFD, or designee, to execute a contract amendment to City Contract No. C-202536 with CCNP for the Westlake FamilySource Center to add $200,000 to expand the emergency food assistance program, subject to the approval of the City Attorney as to form. AUTHORIZE the CIFD to make any corrections, clarifications or revision to the above fund transfer instructions, including any new instructions, in order to effectuate the intent of this Motion, and including any corrections and changes to fund or account numbers; said corrections / clarifications / changes may be made orally, electronically or by any other means. Motion (Hernandez - Hutt) dated 10-28-25"
    }
  ],
  "attachments": [
    {
      "historyId": "ab364084-661b-4950-9764-80a64e9278de",
      "title": "Motion (Hernandez - Hutt) dated 10-28-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=ab364084-661b-4950-9764-80a64e9278de",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=ab364084-661b-4950-9764-80a64e9278de",
      "meeting_id": 17407,
      "has_summary": false
    }
  ],
  "first_seen": "2025-11-04T18:00:00",
  "last_seen": "2025-11-04T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}