{
  "council_file": "25-4118-S14",
  "title": "RESOLUTION (RODRIGUEZ - LEE) relative to designating a location in Council District Seven (CD 7) for enforcement against sitting, lying, sleeping, or storing, using, maintaining, or placing personal property, or otherwise obstructing the public right-of-way, as further detailed in the Los Angeles Municipal Code (LAMC) Section 41.18.",
  "district": "CD 7",
  "appearances": [
    {
      "meeting_id": 17506,
      "date": "2025-12-02T18:00:00",
      "section": "Items for which Public Hearings Have Not Been Held - (10 Votes Required for Consideration)",
      "item_number": "(29)",
      "recommendation": "RESOLVE, pursuant to Section 41.18 of the LAMC, to designate the following location for enforcement against sitting, lying, sleeping, or storing, using, maintaining, or placing personal property, or otherwise obstructing the public right-of-way, up to the maximum distance and effective for the maximum period of time prescribed, and as further detailed in the LAMC: a. Hubbard Street between Foothill Boulevard to Gladstone Avenue - Freeway RESOLVE to direct and authorize the City department(s) with jurisdiction over the identified location to post appropriate notices of the above prohibitions at these locations, and to begin enforcement upon the expiration of any required posting period. Resolution (Rodriguez - Lee) dated 11-07-25"
    }
  ],
  "attachments": [
    {
      "historyId": "0ee3a28b-ebb7-454e-97df-df24d6d5319b",
      "title": "Resolution (Rodriguez - Lee) dated 11-07-25",
      "downloadUrl": "/api/compilemeetingattachmenthistory/historyattachment/?historyId=0ee3a28b-ebb7-454e-97df-df24d6d5319b",
      "previewUrl": "/viewer/preview?id=0&type=8&uid=0ee3a28b-ebb7-454e-97df-df24d6d5319b",
      "meeting_id": 17506,
      "has_summary": false
    }
  ],
  "first_seen": "2025-12-02T18:00:00",
  "last_seen": "2025-12-02T18:00:00",
  "stats": {
    "total_appearances": 1,
    "total_attachments": 1,
    "attachments_with_summaries": 0
  }
}